# ============================================
# ベースとなるPythonイメージを指定
# Python3.14を利用する
# ============================================
FROM python:3.14

# ============================================
# コンテナ内の作業ディレクトリを作成
# 以降の作業は /app 配下で実行される
# ============================================
WORKDIR /app

# ============================================
# requirements.txtだけ先にコピーする
# ライブラリが変更されない限りDockerのキャッシュが利用できる
# ============================================
COPY requirements.txt .

# ============================================
# Pythonライブラリをインストール
#
# --no-cache-dir
#   pipのキャッシュを残さずイメージサイズを小さくする
# ============================================
RUN pip install --no-cache-dir -r requirements.txt

# ============================================
# プロジェクト全体をコンテナへコピー
# ============================================
COPY . .

# ============================================
# Djangoが使用するポート
# ドキュメント目的なので無くても動く
# ============================================
EXPOSE 8000

# ============================================
# コンテナ起動時に実行されるコマンド
#
# 0.0.0.0 にすることで
# ホストPCからアクセス可能になる
# ============================================
CMD ["python", "manage.py", "runserver", "0.0.0.0:8000"]